ci_set_up/my-project/myapp/app/Models/User_model.php

	function authenticate($username, $password)
	{

		$builder = $this->db->table($this->table)
            ->select("{$this->table}.*, {$this->table}.created_at AS user_created_at, " . TBL_CLIENTS . ".*, " . TBL_CLIENTS . ".created_at AS client_created_at")
            ->join(TBL_CLIENTS, TBL_CLIENTS . ".client_id = " . $this->table . ".client_id AND " . TBL_CLIENTS . ".deleted = '0'", "inner")
            ->where('username', $username)
            ->where("{$this->table}.deleted", "0")
            ->limit(1);

        $query = $builder->get();


        if (!$query) {
            return new BASE_Result(null, $this->generateErrorMessage(), null, E_STATUS_CODE::DB_ERROR);
        }

        $numRows = $query->getNumRows();
        $data = [];
        $error = lang("user_not_found"); // default error

        foreach ($query->getResultObject() as $row) {
---
SELECT `app_user`.*, `app_user`.`created_at` AS `user_created_at`, `app_clients`.*, `app_clients`.`created_at` AS `client_created_at`
FROM `app_user`
INNER JOIN `app_clients` ON `app_clients`.`client_id` = `app_user`.`client_id` AND `app_clients`.`deleted` = '0'
WHERE `username` = 'sarika_admin'
AND `app_user`.`deleted` = '0'
 LIMIT 1
SELECT `app_user`.*, `app_user`.`created_at` AS `user_created_at`, `app_clients`.*, `app_clients`.`created_at` AS `client_created_at`
FROM `app_user`
INNER JOIN `app_clients` ON `app_clients`.`client_id` = `app_user`.`client_id` AND `app_clients`.`deleted` = '0'
WHERE `username` = 'sayali_admin'
AND `app_user`.`deleted` = '0'
 LIMIT 1